/*
*********************************************************************************************************
*
*	模块名称 : 串口Shell
*	文件名称 : uartShell.h
*	版    本 : V1.0
*	说    明 : 串口Shell自定义命令
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2025-02-16 astronG  正式发布
*
*	Copyright (C), 2015-2030, astronG
*
*********************************************************************************************************
*/
#ifndef _UARTSHELL_H_
#define _UARTSHELL_H_

extern SemaphoreHandle_t xFocMutex;    // 用于保护FOC参数资源的互斥锁
/* 提供给其他C文件调用的函数 */


#endif

/************************************ astronG (END OF FILE) ************************************/
