/*
*********************************************************************************************************
*
*	模块名称 : MT6816 磁编码器
*	文件名称 : bsp_spi_mt6816.h
*	版    本 : V1.0
*	说    明 : 
*	修改记录 :
*		版本号  日期         作者      说明
*		V1.0    2024-11-25  astronG   正式发布
*
*	Copyright (C), 2020-2030, astronG
*
*********************************************************************************************************
*/
#ifndef __BSP_SPI_MT6816_H
#define __BSP_SPI_MT6816_H

#define M_PI					(3.14159265358f)

uint8_t bsp_spi_mt6816__get_angle(float *_angle);

#endif
