/*
*********************************************************************************************************
*
*	模块名称 : 电机参数识别和编码器校准 模块
*	文件名称 : calibration.h
*	版    本 : V1.0
*	说    明 : 
*	修改记录 :
*		版本号  日期         作者       说明
*		V1.0    2025-02-10  astronG   正式发布
*
*	Copyright (C), 2018-2030, astronG
*
*********************************************************************************************************
*/

#ifndef _CALIBRATION_H_
#define _CALIBRATION_H_



/* 提供给其他C文件调用的函数 */
void Calibration_init(void);

#endif
/************************************ astronG (END OF FILE) ************************************/
